package Codewars;
/*Вам понадобится арендованный автомобиль,
чтобы передвигаться во время вашего отпуска. Менеджер по прокату автомобилей делает вам несколько выгодных предложений.
Каждый день аренды автомобиля стоит 40 долларов. Если вы арендуете автомобиль на 7 или более дней,
вы получаете 50 долларов от общей суммы. В качестве альтернативы, если вы арендуете автомобиль на 3 или более дней,
вы получаете 20 долларов от общей суммы.
Напишите код, который выдает общую сумму за разные дни(d).
 */
public class Transportation_on_vacation {
    public static int rentalCarCost(int d) {
        int sum = d*40;
        if(sum>=120 & sum<280) sum -= 20;
        if(sum>=280) sum -= 50;
        return sum;
    }

    public static void main (String[] args){
        int days = 3;
        System.out.println(rentalCarCost(days));
    }
}
